Enums/НаправленияСНТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>НаправленияСНТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СНТВызовСервераПовтИсп/Ext/Module.bsl
Функция ИмяТаблицыКонтрагентов(Знач НаправленияСНТ) Экспорт
	
	Если НаправленияСНТ = Перечисления.НаправленияСНТ.Входящий Тогда
		Имя = "Поставщики";	
	ИначеЕсли НаправленияСНТ = Перечисления.НаправленияСНТ.Исходящий Тогда
		Имя = "Получатели";	
	Иначе
		ВызватьИсключение НСтр("ru = 'Параметр ""НаправленияСНТ"" имеет некорректное значение.'");
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

Функция ИмяРеквизитаКонтрагента(Знач НаправленияСНТ) Экспорт
	
	Если НаправленияСНТ = Перечисления.НаправленияСНТ.Входящий Тогда
		Имя = "Поставщик";	
	ИначеЕсли НаправленияСНТ = Перечисления.НаправленияСНТ.Исходящий Тогда
		Имя = "Получатель";	
	Иначе
		ВызватьИсключение НСтр("ru = 'Параметр ""НаправленияСНТ"" имеет некорректное значение.'");
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

Функция ИмяТаблицыСтруктурныхЕдиниц(Знач НаправленияСНТ) Экспорт  
	
	Если НаправленияСНТ = Перечисления.НаправленияСНТ.Входящий Тогда
		Имя = "Получатели";	
	ИначеЕсли НаправленияСНТ = Перечисления.НаправленияСНТ.Исходящий Тогда
		Имя = "Поставщики";	
	Иначе
		ВызватьИсключение НСтр("ru = 'Параметр ""НаправленияСНТ"" имеет некорректное значение.'");
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

Функция ИмяРеквизитаСтруктурнойЕдиницы(Знач НаправленияСНТ) Экспорт
	
	Если НаправленияСНТ = Перечисления.НаправленияСНТ.Входящий Тогда
		Имя = "Получатель";	
	ИначеЕсли НаправленияСНТ = Перечисления.НаправленияСНТ.Исходящий Тогда
		Имя = "Поставщик";	
	Иначе
		ВызватьИсключение НСтр("ru = 'Параметр ""НаправленияСНТ"" имеет некорректное значение.'");
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции
